fds/railscode_fds/app/controllers/black_lists_controller.rb

SELECT "black_lists".* FROM "black_lists"
---
	def index
		@black_lists = BlackList.all

INSERT INTO "black_lists" ("cid", "mac", "transcationtime", "registeredby", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cid", "ddd"], ["mac", "ddd"], ["transcationtime", Mon, 06 Feb 2017], ["registeredby", "ddd"], ["created_at", 2017-02-06 11:28:58 UTC], ["updated_at", 2017-02-06 11:28:58 UTC]]
---
		logger.debug "hyperledger_list.registeredby $$$$$$$$$$$$$$$$$ : #{@hyperledger_list.registeredby}"

		respond_to do |format|
				if @black_list.save

DELETE FROM "black_lists" WHERE "black_lists"."id" = ?  [["id", 1]]
---
	def destroy
		@black_list.destroy

SELECT  "black_lists".* FROM "black_lists" WHERE "black_lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
		def set_black_list
			@black_list = BlackList.find(params[:id])