fds/railscode_fds/app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions"
---
  def index
    @transactions = Transaction.all

INSERT INTO "transactions" ("seq", "stats", "cid", "mac", "accountnum", "txtime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @transaction = Transaction.new(transaction_params)

=begin
    #HyperLedger 데이터를 출력하기 위한 객체 생성
    @hyperledger_list = Transaction.new()

    #HyperLedger 응답값 저장
    @hyperledger_data = put_hyperledger
    logger.debug "hyperledger_response $$$$$$$$$$$$ : #{@hyperledger_data}"

    #HyperLedger 응답값 저장 객체
    @hyperledger_response = JSON.parse(put_hyperledger)
    logger.debug "parsed_hyperledger_response $$$$$$$$$$$$$$$ : #{@hyperledger_response}"


    #추후에는 HyperLedger 실 데이터로 변경 처리
    @dummy_data = "123456|AA-BB-CC-DD|3fdd6dfg98ac|2017-07-07|신한은행"
    responseArr = @dummy_data.split("|")
    logger.debug "split data $$$$$$$$$$$$$ #{responseArr}"
=end

    respond_to do |format|
      if @transaction.save

UPDATE "transactions" SET "stats" = ?, "cid" = ?, "mac" = ?, "accountnum" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["stats", "정상거래"], ["cid", "1234567890"], ["mac", "AA-BB-CC-DD"], ["accountnum", "1234-1234-1234"], ["updated_at", 2017-02-09 04:52:15 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @transaction.update(transaction_params)

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_transaction
      @transaction = Transaction.find(params[:id])